Getting the same error. Seems like TF sets BGP settings underwater even when you don't enable BGP...

# module.virtual_network_gateway.azurerm_virtual_network_gateway.vgw will be created
  + resource "azurerm_virtual_network_gateway" "vgw" {
      + active_active       = false
      + enable_bgp          = false
      + generation          = "Generation2"
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "test"
      + resource_group_name = "test"
      + sku                 = "VpnGw2AZ"
      + type                = "Vpn"
      + vpn_type            = "RouteBased"

      + bgp_settings {
          + asn         = (known after apply)
          + peer_weight = (known after apply)

          + peering_addresses {
              + apipa_addresses       = (known after apply)
              + default_addresses     = (known after apply)
              + ip_configuration_name = (known after apply)
              + tunnel_ip_addresses   = (known after apply)
            }
        }
    }